Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/death_related_benefits/benefits_and_entitlements_following_a_death.html.txt.tmx
Source language: en
Languages: ga

source: Benefits and entitlements following a death
ga: Sochair agus teidlíochta tar éis báis

source: After a bereavement you may need financial support
ga: D'fhéadfadh tacaíocht airgeadais a bheith uait tar éis méala

source: The Department of Social Protection provides certain once-off payments to help out families during this difficult time
ga: Soláthraíonn an Roinn Coimirce Sóisialaí íocaíochtaí áirithe aon uair amháin chun cabhrú le teaghlaigh i rith na tréimhse deacra seo

source: Your local Department of Social Protection's representative (formerly known as the Community Welfare Officer) deals with some of these payments
ga: Tá ionadaithe na Roinne Coimirce Sóisialaí (tugadh Oifigigh Leasa Pobail (CWOanna) orthu roimhe seo) ag deileáil leis araon na híocaíochtaí seo

source: You must have made a certain number of PRSI contributions to be eligible for some social welfare payments
ga: Caithfidh méid áirithe ranníocaíochtaí ÁSPC a bheith íoctha agat chun go mbeifeá i dteideal íocaíochtaí leasa shóisialaigh áirithe

source: You may be eligible for other payments, if you pass a means test or if you are in urgent need
ga: D'fhéadfá a bheith i dteideal íocaíochtaí eile, lena n-áirítear íocaíochtaí atá láimhseáilte ag an t-ionadaí Roinne Coimirce Sóisialaí, má shásaíonn tú tástáil acmhainne nó má tá géarghá ort

source: Time limits apply for many payments, so apply as early as is possible
ga: Cuirtear teorainneacha ama i bhfeidhm, mar sin is ceart cur isteach air chomh luath agus is féidir

source: You cannot be expected to do everything right away, but if the deceased was getting a social welfare payment or you were claiming for them as a dependant or you were getting a Carer's Allowance to look after them, it's important that you notify the Department of Social Protection within the first few days of the death
ga: Níltear ag súil go n-eagróidh tú gach rud láithreach bonn, ach más rud é go raibh an duine éagtha ag fáil íocaíocht leasa shóisialaigh nó go raibh tú ag éileamh mar chleithiúnaí ar a son nó go raibh tú ag fáil Liúntas Cúramóra chun aire a thabhairt dóibh, tá sé tábhachtach an bás chur in iúl don Roinn Coimirce Sóisialaí laistigh den chéad chúpla lá tar éis an bháis

source: Notifying the Department does not mean the payment will be taken back immediately
ga: Ní stopfar an íocaíocht chomh luath agus a chuirtear an Roinn ar an eolas

source: In many cases, the spouse, civil partner, cohabitant, parent or carer may continue to receive a payment for six weeks following the death
ga: Go minic, leanfar den sochar sin a íoc go ceann tréimhse 6 seachtaine tar éis dáta an bháis leis an gcéile/páirtnéir sibhialta/comhchónaitheoir nó tuismitheoir nó cúramaí

source: Help with funeral costs
ga: Cabhair le costais shochraide

source: You can get help with the cost of the funeral:
ga: Is féidir cúnamh a fháil chun íoc as costas na sochraide:

source: • The Widowed or Surviving Civil Partner Grant is a once-off payment to widows/widowers/surviving civil partners with dependent children.This payment was formerly called the Widowed Parent Grant
ga: • Is íocaíocht aon uair amháin é an Deontas Baintreachais nó Páirtnéara Shibhialta Mharthanaigh a íoctar le baintreacha, baintreacha fir nó páirtnéirí sibhialta marthanacha le leanaí cleithiúnacha

source: • If someone dies from an accident at work, a Funeral Grant is available
ga: • Má fhaigheann duine bás mar gheall ar thimpiste sa láthair oibre, tá Deontas Sochraide ar fáil

source: • The Bereavement Grant was discontinued in 2014
ga: • Cuireadh deireadh leis an Deontas Méala í 2014

source: Whether you qualify or not for one of the above grants you may be eligible for an Exceptional Needs Payment to help with funeral costs if you are on a low income
ga: Pé acu, má tá tú nó mura bhfuil tú i dteideal deontas thuas, tá seans ann go bhfuil tú i dteideal na hÍocaíochta do Riachtanais Eisceachtúla chun cabhrú le híoc as costais na sochraide má tá tú ar ioncam íseal

source: Each case is decided on its merits
ga: Socraítear gach cás ar a thuillteanas

source: The Community Welfare Service prefers if you apply before the funeral takes place, but in practice, most people apply afterwards
ga: B'fhearr le d'ionadaí Roinne Coimirce Sóisialaí go gcuirfeá isteach air roimh an tsochraid, ach go hiondúil cuireann an formhór isteach air ina diaidh

source: In many cases a payment or a grant cannot be paid until all the necessary documentation is received
ga: Go minic, níl íocaíocht nó deontas iníoctha go dtí go bhfaightear an cháipéisíocht iomchuí ar fad

source: If you are claiming the grant, you are responsible for the production of certificates, documents and any information required, for example:
ga: Má tá tú ag éileamh an deontais, tusa atá freagrach as teastais, cáipéisí, nó aon fhaisnéis riachtanach a sholáthar, mar shampla,

source: • Marriage or Civil Partnership certificate (to prove your relationship to the deceased)
ga: • Teastas Pósta nó Pháirtneireachta Shibhialta (chun do ghaol leis an duine éagtha a chruthú),

source: • The deceased person's Personal Public Service number (PPS number)
ga: • Uimhir Phearsanta Seirbhíse Poiblí (PSP) an duine éagtha

source: • Your PPS number may also be required
ga: • Seans go mbeidh d'Uimhir PSP ag teastáil

source: If you were living with or dependent on the deceased, any current benefits or payments you are getting may change, or you may be able to claim additional benefits
ga: Más rud é go raibh tú i do chónaí le nó go raibh tú mar chleithiúnaí an duine éagtha, tá seans ann go n-athróidh aon sochair nó íocaíochtaí a fhaigheann tú faoi láthair, nó go bhféadfaidh tú sochair bhreise a éileamh

source: Depending on your income and circumstances you may be entitled to a social welfare payment in your own right, for example:
ga: Ag brath ar d'ioncam agus cúinsí, féadfaidh tú a bheith i dteideal íocaíochta leasa shóisialaigh as do cheart féin, mar shampla:

source: A Widow's, Widower's or Surviving Civil Partner's Contributory Pension and related social welfare benefits may be payable if either you or your deceased spouse or civil partner has enough PRSI contributions
ga: D'fhéadfá a bheith incháilithe don Phinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach) agus do shochair leasa shóisialaigh a bhaineann leis má tá go leor ranníocaíochtaí ÁSPC agat nó ag do chéile éagtha

source: This payment was formerly called the Widow's/Widower's (Contributory) Pension
ga: Tugadh Pinsean Ranníocach Baintrí/Baintrí Fir roimhe seo

source: A Widow's, Widower's or Surviving Civil Partner's Non-Contributory Pension is paid to widowed people or surviving civil partners without dependent children, who do not qualify for a contributory pension and who pass a means test
ga: Íoctar an Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Neamh-Ranníocach) le daoine nach bhfuil incháilithe don phinsean ranníocach agus a shásaíonn tástáil acmhainne

source: This payment was formerly called the Widow's/Widower's (Non-Contributory) Pension
ga: Tugadh Pinsean Neamh-Ranníocach Baintrí/Baintrí Fir roimhe seo

source: A Guardian's payment is paid to the child's guardian up to the child's 18th birthday or 22nd birthday if he or she is in full-time education
ga: Íoctar Íocaíocht Chaomhnóra le caomhnóir an linbh go dtí go mbíonn 18 bliana slán ag an leanbh nó go dtí a 22ú breithlá má tá sé nó sí ar chúrsa oideachais lánaimseartha

source: A One-Parent Family Payment can be paid to you if you are parenting alone as a result of the death of your spouse, civil partner or cohabitant
ga: Féadfaidh tú a bheith incháilithe i gcomhair Íocaíochta do Theaghlach Aontuismitheora más tuismitheoir aonair tú mar thoradh ar bhás do chéile/pháirtnéir sibhialta/chomhchónaitheoir

source: If you also qualify for a Widow's, Widower's or Surviving Civil Partner's Contributory Pension you will have to choose which payment is of most benefit to you because you cannot get both
ga: Má tá tú incháilithe do Phinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach) chomh maith, beidh ort socrú ar cé acu is mó tairbhe duit mar ní bhfaighidh tú an dá cheann

source: If a person dies because of an accident at work or occupational disease, Death Benefit under the Occupational Injuries Scheme may be paid to their surviving spouse or civil partner
ga: Íoctar an Pinsean Tuismitheora Chleithiúnaigh le tuismitheoir má fhaigheann a pháiste bás mar thoradh ar ghalar nó timpiste a tharla mar gheall ar a chuid oibre

source: Bereavement can cause financial difficulties
ga: Féadann deacrachtaí airgeadais teacht le méala

source: The Supplementary Welfare Allowance Scheme provides financial support to people with low incomes
ga: Cuireann an Scéim Liúntas Forlíontach Leasa Shóisialaigh tacaíocht airgeadais ar fáil do dhaoine ar ioncam íseal

source: You may qualify for a weekly supplement payment under the scheme to meet certain special needs, for example, help with rent and fuel costs
ga: Féadfaidh tú bheith i dteideal forlíonadh seachtainiúil a fháil faoin scéim chun riachtanais speisialta áirithe a shásamh, mar shampla, forlíonadh le cíos agus le costais breosla

source: In addition, payments can also be made for urgent or exceptional needs
ga: Ina theannta sin, féadfar íocaíochtaí i gcás riachtanais phráinneacha nó eisceachtúla a dhéanamh

source: There are specific rules about taxation in the year of a person's death, for example, a tax refund may be due
ga: Tá rialacha faoi leith faoi chúrsaí cánach i mbliain an bháis, mar shampla, b'fhéidir go bhfuil aisíoc cánach le n-íoc

source: There are also extra credits for parents in the years following the death of a spouse or civil partner. Find out more information about tax in the year of death and the years following a death
ga: Tá creidmheasanna breise chomh maith do thuismitheoirí sna blianta i ndiaidh báis an chéile nó pháirtnéir sibhialta Tá tuilleadh eolais anseo faoi cháin i mbliain an bháis agus sna blianta i ndiaidh an bháis

source: To check your entitlements, contact your nearest Intreo centre or social welfare local office or your nearest Citizens Information Centre
ga: Chun do theidlíochtaí a sheiceáil, déan teagmháil leis an Ionad Intreo agus oifig áitiúil leasa shóisialaigh is gaire duit nó an t-Ionad Faisnéise do Shaoránaigh is gaire duit

source: You can also phone the Citizens Information Phone Service on 0761 07 4000
ga: Is féidir leat glaoch chomh maith ar an tSeirbhís Teileafóin um Fhaisnéis do Shaoránaigh ar 0761 07 4000

source: Read here for further information about support following a death
ga: Tá tuilleadh eolais anseo faoi thacaíocht tar éis báis
